per_cent = {'ТКБ': 5.6, 'СКБ': 5.9, 'ВТБ': 4.28, 'СБЕР': 4.0}
money = int(input("Введите сумму, которую вы планируете положить под проценты: "))
print()
percent = list(per_cent.values())
deposit = {'"ТКБ"': round(percent[0]/100*money),'"СКБ"': round(percent[1]/100*money),'"ВТБ"':  round(percent[2]/100*money),'"СБЕР"':  round(percent[3]/100*money)}
print('''Максимальная сумма которую вы можете заработать в "ТКБ" соcтавляет:''', deposit['"ТКБ"'])
print('''Максимальная сумма которую вы можете заработать в "СКБ" соcтавляет:''', deposit['"СКБ"'])
print('''Максимальная сумма которую вы можете заработать в "ВТБ" соcтавляет:''', deposit['"ВТБ"'])
print('''Максимальная сумма которую вы можете заработать в "СБЕР" соcтавляет:''', deposit['"СБЕР"'])
profit = deposit.values()
print()
print("Максимальная сумма, которую вы можете заработать:", max(profit),"в", max(deposit, key=deposit.get))
